Revit 2027 API
EnergyAnalysisSurface.Type Property
 The gbXML surface type attribute.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public gbXMLSurfaceType Type { get; }
Public ReadOnly Property Type As gbXMLSurfaceType
	Get
public:
property gbXMLSurfaceType Type {
	gbXMLSurfaceType get ();
}
member Type : gbXMLSurfaceType with get
Property Value
gbXMLSurfaceType
Remarks
 The type of surface is figured out depending on the source element and the number of space adjacencies.
If there is no associate source element and no space adjacencies, it will have a type of Shade. If there are any space adjacencies, it will have a type of Air.
If the source element is a Wall or a Curtain Wall and have one space adjacency, it will have a type of ExteriorWall.
If the source element is a Wall or a Curtain Wall and have two space adjacencies, it will have a type of InteriorWall.
If the source element is a Wall or a Curtain Wall and the type Function parameter is set to "Interior" or "CoreShaft", it will have a type of InteriorWall.
If the source element is a Wall or a Curtain Wall and have one space adjacency and if it is below grade, it will have a type of UndergroundWall.
If the source element is a Floor and have one space adjacency, it will have a type of SlabOnGrade. If the source element is above grade, it will have a type of RaisedFloor. If the source element is below grade, it will have a type of UndergroundSlab.
If the source element is a Floor and have two space adjacencies, it will have a type of InteriorFloor.
If the source element is a Floor and the type Function parameter is set to "Interior", it will have a type of InteriorFloor.
If the source element is a Roof or a Ceiling and have one space adjacency, it will have a type of Roof.
If the source element is a Roof or a Ceiling and have one space adjacency and is below grade, it will have a type of UndergroundCeiling.
If the source element is a Roof or a Ceiling and have two space adjacencies, it will have a type of Ceiling.
See Also
Reference
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace